music-knowledge-backend/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    games = Game.all.sort_by { |game| game.score }.reverse

INSERT INTO "games" ("score", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", 0], ["user_id", 10], ["created_at", "2020-10-20 19:57:16.299681"], ["updated_at", "2020-10-20 19:57:16.299681"]]
---
  def create
    game = Game.create(games_params)

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "games" SET "score" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["score", 1700], ["updated_at", "2020-10-22 20:10:10.854312"], ["id", 7]]
---
  def update
    game = Game.find(params[:id])
    game.update(games_params)