music-knowledge-backend/app/controllers/users_controller.rb

  def create
    user = User.create(params.require(:user).permit(:name))
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sean L"], ["created_at", "2020-10-20 19:44:59.277123"], ["updated_at", "2020-10-20 19:44:59.277123"]]